Catalogs/Образец.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Образец</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Картинки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОписаниеКартинка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Картинка</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Единица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмеренияНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Образец/Forms/ФормаШильдик/Ext/Form/Module.bsl
&НаКлиенте
Перем ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, СтркутураНстроекПечати;

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Образец", Образец);
	
	Если НЕ ЗначениеЗаполнено(Образец) Тогда
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	НачальныеНастройки();
	ДанныеОбразца 			= ПолучитьДанныеОбразца(Образец);
	СтркутураНстроекПечати 	= ПолучитьСтруктуруПечати();
	ТекстНаименование 		= ДанныеОбразца.Наименование;
	
	СтруктураПечати = Справочники.Образец.ПолучитьСтркутуруНстроекПечати();

	
	Если ПустаяСтрока(ДанныеОбразца.Обработка) Тогда
	
		Элементы.ГруппаОбработка.ТолькоПросмотр = Истина;
		Элементы.Обработка.Видимость = Ложь;
	
	КонецЕсли;
	
	Если ДанныеОбразца.Материалы.Количество() = 0 Тогда
	
		Элементы.ГруппаМатериалы.ТолькоПросмотр = Истина;
		Элементы.Метериалы.Видимость = Ложь;
	
	КонецЕсли;
	
	ПриИзмененииНастроек();
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруПечати()

	Возврат Справочники.Образец.ПолучитьСтркутуруНастроекПечати()	

КонецФункции // ПолучитьСтруктуруПечати()
 

&НаСервереБезКонтекста
Функция ПолучитьДанныеОбразца(Образец)
		
    Возврат Справочники.Образец.ПолучитьДанныеОбразца(Образец);
	
КонецФункции // ПолучитьДанныеОбразца()

&НаКлиенте
Процедура НачальныеНастройки()

	РазмерШрифтаНаименования 	= ?(РазмерШрифтаНаименования = 0, 	9,  РазмерШрифтаНаименования);
	РазмерШрифтаОбработка 		= ?(РазмерШрифтаОбработка = 0, 		8,  РазмерШрифтаОбработка);
	РазмерШрифтаМатериалы 		= ?(РазмерШрифтаМатериалы = 0, 		8,  РазмерШрифтаМатериалы);
	РазмерШКпоВысоте			= ?(РазмерШКпоВысоте = 0,			7,  РазмерШКпоВысоте);
	РазмерШКпоШирине			= ?(РазмерШКпоШирине = 0,			15, РазмерШКпоШирине);

КонецПроцедуры // НачальныеНастройки() 

&НаСервереБезКонтекста
Функция СформироватьТаблицуНаСервере(Образец, СтркутураНстроекПечати, ДанныеОбразца = Неопределено)
	
	
	Справочники.Образец.СформироватьТаблицуНаСервере(Образец, СтркутураНстроекПечати, ДанныеОбразца);
	
Конецфункции

Функция ПолучитьТаблицуМатериалы(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок)

	ТабДок = Новый ТабличныйДокумент;
	Если ДанныеОбразца.Материалы.Количество() = 0 Тогда
	    Возврат ТабДок;
	КонецЕсли;
	
	ЛинияГраницы = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1); 
	стПараметровОбласти.ГраницаСлева			= ЛинияГраницы;
	стПараметровОбласти.ГраницаСправа			= ЛинияГраницы;
	стПараметровОбласти.ГраницаСверху			= ЛинияГраницы;
	стПараметровОбласти.ГраницаСнизу			= ЛинияГраницы;
	стПараметровОбласти.ЦветРамки				= "000000000";
	стПараметровОбласти.ДлинаОбласти 			= 1;		
	
	Для х = 0 По ДанныеОбразца.Материалы.Количество() - 1 Цикл
		
		ДанныеСтроки = ДанныеОбразца.Материалы[х];
		
		стПараметровОбласти.НомерКолонки = 2;
		стПараметровОбласти.Текст 		= ДанныеСтроки.Номенклатура;
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		стПараметровОбласти.НомерКолонки = 3;
		стПараметровОбласти.Текст 		= ДанныеСтроки.Количество;
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		стПараметровОбласти.НомерКолонки = 4;
		стПараметровОбласти.Текст 		= ДанныеСтроки.Единица;
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		стПараметровОбласти.НомерКолонки = 5;
		стПараметровОбласти.Текст 		= ДанныеСтроки.Примечание;
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		
		стПараметровОбласти.НомерСтроки = стПараметровОбласти.НомерСтроки + 1;
		
	КонецЦикла;
	
	Возврат ТабДок;

КонецФункции // ПолучитьТаблицуНаименовнаия()

Функция ПолучитьТаблицуОбработка(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок)

	ПоискРазмера = Истина;
	РазмерНайден = Ложь;
	ПоследнийРаз = Ложь;
	
	Пока ПоискРазмера Цикл
		
		Если ПоследнийРаз Тогда
			ПоискРазмера = Ложь;
		КонецЕсли;
		
		ТабДок = Новый ТабличныйДокумент;
		омТабличныйДокументКлиентСервер.УстановитьШиринуКолонок(ТабДок, мШиринаКолонок);
		Область = омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		ВысотаПустойОбласти = ВысотаОбластиВмм(Область, ТабДок);
		Область.Текст 		= ДанныеОбразца.Обработка;
		
		Если ПоискРазмера Тогда
			
			ВысотаСТекстом = ВысотаОбластиВмм(Область, ТабДок);
			
			Если ВысотаПустойОбласти < ВысотаСТекстом Тогда
				СтруктрураОбъеденненыхЯчеек.Обработка = СтруктрураОбъеденненыхЯчеек.Обработка + 1;
				Если СтруктрураОбъеденненыхЯчеек.Обработка > СтруктрураОбъеденненыхЯчеек.МаксимальнаяШирина Тогда
					Прервать;	
				КонецЕсли;

				Если РазмерНайден Тогда
					ПоследнийРаз = Истина;
				КонецЕсли;
				
			Иначе
				Если СтруктрураОбъеденненыхЯчеек.Обработка = 1 Тогда
					Прервать;	
				КонецЕсли;
				РазмерНайден = Истина;
				СтруктрураОбъеденненыхЯчеек.Обработка = СтруктрураОбъеденненыхЯчеек.Обработка - 1;
			КонецЕсли;
			
			стПараметровОбласти.ДлинаОбласти = СтруктрураОбъеденненыхЯчеек.Обработка;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции // ПолучитьТаблицуНаименовнаия()

Функция ПолучитьШК(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти)
	
	КоличествоМиллиметровВПикселе = омТабличныйДокументСерверПовтор.ПолучитьКоличествоМиллиметровВПикселе();
	ТабДок = Новый ТабличныйДокумент;
	
	РисунокШтрихкода = ТабДок.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка); 
	РисунокШтрихкода.ВыводитьНаПечать 		= Истина;
	РисунокШтрихкода.Высота					= РазмерШКпоВысоте / КоличествоМиллиметровВПикселе;
	РисунокШтрихкода.Ширина					= РазмерШКпоШирине / КоличествоМиллиметровВПикселе; 
	
	
	ПараметрыШтрихкода = ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
	ПараметрыШтрихкода.Ширина 				= Окр(РисунокШтрихкода.Ширина * 3);
	ПараметрыШтрихкода.Высота 				= Окр(РисунокШтрихкода.Высота * 3);
    ПараметрыШтрихкода.Штрихкод				= ДанныеОбразца.ШК;
	ПараметрыШтрихкода.ТипКода 				= 4;
	ПараметрыШтрихкода.РазмерШрифта 		= 14;
	ПараметрыШтрихкода.СохранятьПропорции 	= Истина;
	ПараметрыШтрихкода.ОтображатьТекст 		= ТекстНаШтрихКоде;
    
    РисунокШтрихкода.Картинка 		= 	ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода).Картинка;
    РисунокШтрихкода.РазмерКартинки = РазмерКартинки.Пропорционально;
	РисунокШтрихкода.ГраницаСверху  = Ложь;
	РисунокШтрихкода.ГраницаСлева  	= Ложь;
	РисунокШтрихкода.ГраницаСнизу  	= Ложь;
	РисунокШтрихкода.ГраницаСправа  = Ложь;
	
	Возврат ТабДок;

КонецФункции // ПолучитьШК()

Функция ПолучитьТаблицуНаименовнаия(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок)
	
	ПоискРазмера = Истина;
	РазмерНайден = Ложь;
	ПоследнийРаз = Ложь;
	
	Пока ПоискРазмера Цикл
		
		Если ПоследнийРаз Тогда
			ПоискРазмера = Ложь;
		КонецЕсли;
		
		ТабДок = Новый ТабличныйДокумент;
		омТабличныйДокументКлиентСервер.УстановитьШиринуКолонок(ТабДок, мШиринаКолонок);
		Область = омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		ВысотаПустойОбласти = ВысотаОбластиВмм(Область, ТабДок);
		Область.Текст 		= ТекстНаименование;
		
		Если НЕ ПоследнийРаз Тогда
			
			ВысотаСТекстом = ВысотаОбластиВмм(Область, ТабДок);
			
			Если ВысотаПустойОбласти < ВысотаСТекстом Тогда
				СтруктрураОбъеденненыхЯчеек.Наименование = СтруктрураОбъеденненыхЯчеек.Наименование + 1;
				Если СтруктрураОбъеденненыхЯчеек.Наименование > СтруктрураОбъеденненыхЯчеек.МаксимальнаяШирина Тогда
					Прервать;	
				КонецЕсли;
				Если РазмерНайден Тогда
					ПоследнийРаз = Истина;
				КонецЕсли;
			Иначе
				Если СтруктрураОбъеденненыхЯчеек.Наименование = 1 Тогда
					Прервать;	
				КонецЕсли;
				РазмерНайден = Истина;
				СтруктрураОбъеденненыхЯчеек.Наименование = СтруктрураОбъеденненыхЯчеек.Наименование - 1;
			КонецЕсли;
			
			стПараметровОбласти.ДлинаОбласти = СтруктрураОбъеденненыхЯчеек.Наименование;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабДок;

КонецФункции // ПолучитьТаблицуНаименовнаия()

Функция ВысотаОбластиВмм(пОбласть, пТабДок)
    
    Надпись = пТабДок.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);    
    Надпись.Расположить(пОбласть);    
    Высота = Надпись.Высота;    
    пТабДок.Рисунки.Удалить(Надпись);
    
    Возврат(Высота);
    
КонецФункции

&НаКлиенте
Процедура ПриИзмененииНастроек()
	
	ЗаполнитьЗначенияСвойств(СтруктураПечати, ЭтаФорма);
	СформироватьТаблицуНаСервере(Объект.Ссылка, ДанныеОбразца, СтруктураПечати);

КонецПроцедуры // ПриИзмененииНастроек()


&НаКлиенте
Процедура РазмерШрифтаНаименованияПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ТекстНаименованиеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ТекстНаШтрихКодеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура РазмерШрифтаОбработкаПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура МетериалыПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура РазмерШрифтаМатериалыПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ПолужирныйНаименованиеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ПолужирныйОбработкаПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ПолужирныйМатериалыПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьШКПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура РазмерШКпоВысотеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура РазмерШКпоШиринеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьРамкуПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ИдентификаторПечатнойФормы = "ШилдикОбразца";
	НазваниеПечатнойФормы = НСтр("ru = 'Шильдик образца'");
	
	МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");
	КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
	
	ПечатнаяФорма = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
	ПечатнаяФорма.СинонимМакета = НазваниеПечатнойФормы;
	ПечатнаяФорма.ТабличныйДокумент = Пример;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы;
	
	ОбластиОбъектов = Новый СписокЗначений;
	МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);
	
КонецПроцедуры
